Repository: alexjane19/chakame
Catalog: lib/l10n/app_*.arb
Languages: fa

# appTitle
source: Chakame
fa: چکامه

source: Favorites
fa: علاقه‌مندی‌ها

# favoritesWithCount
source: Favorites ({count})
fa: علاقه‌مندی‌ها ({count})

source: Search in favorites
fa: جستجو در علاقه‌مندی‌ها

source: All Poets
fa: همه شاعران

source: No Favorites
fa: هیچ علاقه‌مندی‌ای نیست

# noFavoritesDescription
source: Add your favorite poems by clicking the heart button
fa: با کلیک بر روی دکمه قلب، اشعار مورد علاقه خود را اضافه کنید

source: Back to Home
fa: بازگشت به صفحه اصلی

# noSearchResults
source: No Results Found
fa: نتیجه‌ای یافت نشد

# changeSearchOrFilter
source: Change your search term or poet filter
fa: عبارت جستجو یا فیلتر شاعر را تغییر دهید

source: Sort
fa: مرتب‌سازی

source: Newest
fa: جدیدترین

source: Oldest
fa: قدیمی‌ترین

source: Poet Name
fa: نام شاعر

source: Poem Title
fa: عنوان شعر

source: Delete All
fa: حذف همه

source: Export
fa: صادر کردن

source: Delete All Favorites
fa: حذف همه علاقه‌مندی‌ها

# deleteAllConfirmation
source: Are you sure you want to delete all favorites? This action cannot be undone.
fa: آیا از حذف همه علاقه‌مندی‌ها مطمئن هستید؟ این عمل غیرقابل بازگشت است.

source: Cancel
fa: انصراف

source: Delete
fa: حذف

source: Favorites exported
fa: علاقه‌مندی‌ها صادر شد

source: Remove from Favorites
fa: حذف از علاقه‌مندی‌ها

# removeFromFavoritesConfirmation
source: Are you sure you want to remove "{title}" from favorites?
fa: آیا از حذف "{title}" مطمئن هستید؟

source: Poem Text
fa: متن شعر

source: Operations
fa: عملیات

source: Copy Text
fa: کپی متن

source: Share
fa: اشتراک‌گذاری

source: Add to Favorites
fa: افزودن به علاقه‌مندی‌ها

# removeFromFavoritesShort
source: Remove from Favorites
fa: حذف از علاقه‌مندی‌ها

# poemInfo
source: Poem Information
fa: اطلاعات شعر

source: Title:
fa: عنوان:

source: Poet:
fa: شاعر:

source: Category:
fa: دسته‌بندی:

source: Verse Count:
fa: تعداد ابیات:

# versesText
source: {count} verses
fa: {count} بیت

source: View in Ganjoor
fa: مشاهده در گنجور

# poemCopied
source: Poem copied to clipboard
fa: شعر کپی شد

source: Poem added to favorites
fa: شعر به علاقه‌مندی‌ها اضافه شد

source: Poem removed from favorites
fa: شعر از علاقه‌مندی‌ها حذف شد

# ganjoorSource
source: Ganjoor
fa: گنجور

# link
source: Link: {url}
fa: لینک: {url}

source: Copy
fa: کپی

source: New Poem
fa: شعر جدید

source: Get Random Poem
fa: دریافت شعر تصادفی

source: Loading...
fa: در حال دریافت...

source: Retry
fa: تلاش مجدد

# poemLoadError
source: Error loading poem
fa: خطا در دریافت شعر

source: ... continue poem
fa: ... ادامه شعر

# copyShort
source: Copy
fa: کپی

source: Today's Poet
fa: شاعر امروز

source: Explore Poems
fa: کاوش اشعار

source: Search Poems
fa: جستجوی اشعار

source: Poets
fa: شاعران

source: Settings
fa: تنظیمات

source: Recent Poems
fa: اشعار اخیر

source: Home
fa: خانه

source: Welcome
fa: خوش آمدید

# welcomeMessage
source: Welcome to the beautiful world of Persian poetry
fa: به دنیای زیبای شعر فارسی خوش آمدید

source: Notifications
fa: اعلان‌ها

source: About
fa: درباره

source: Dark Mode
fa: حالت تاریک

source: Font Selection
fa: انتخاب فونت

source: Notification Time
fa: زمان اعلان

source: Test Notification
fa: تست اعلان

source: OK
fa: تأیید

source: All
fa: همه

# noFavoritesAdded
source: No poems have been added to favorites yet
fa: هنوز شعری به علاقه‌مندی‌ها اضافه نشده

# searchPoemsTitle
source: Search Poems
fa: جستجوی اشعار

# randomPoemFromPoet
source: Random poem from this poet
fa: شعر تصادفی از این شاعر

# gettingPoemFromPoet
source: Getting poem from {poetName}...
fa: در حال دریافت شعر از {poetName}...

source: Daily Notifications
fa: اعلان‌های روزانه

source: Send test notification
fa: ارسال اعلان آزمایشی

# favoritesTitle
source: Favorites
fa: علاقه‌مندی‌ها

# poemsCount
source: {count} poems
fa: {count} شعر

source: Clear Cache
fa: پاک کردن حافظه موقت

# clearCacheSubtitle
source: Delete cached poems
fa: حذف اشعار کش شده

source: Backup
fa: پشتیبان‌گیری

# backupSubtitle
source: Export settings and favorites
fa: صادر کردن تنظیمات و علاقه‌مندی‌ها

# aboutApp
source: About {appName}
fa: درباره {appName}

# appVersion
source: Version {version}
fa: نسخه {version}

# version
source: Version {version}
fa: نسخه {version}

source: Help
fa: راهنما

# helpSubtitle
source: How to use the app
fa: نحوه استفاده از برنامه

source: Data Source
fa: منبع داده‌ها

source: Test notification sent
fa: اعلان آزمایشی ارسال شد

# storageStats
source: Storage Statistics
fa: آمار ذخیره‌سازی

# cachedPoems
source: Cached poems: {count}
fa: اشعار کش شده: {count}

source: Favorites: {count}
fa: علاقه‌مندی‌ها: {count}

# cachedPoets
source: Cached poets: {count}
fa: شاعران کش شده: {count}

source: Settings: {count}
fa: تنظیمات: {count}

# clearCacheTitle
source: Clear Cache
fa: پاک کردن حافظه موقت

# clearCacheConfirmation
source: Are you sure you want to clear the cache?
fa: آیا از پاک کردن حافظه موقت مطمئن هستید؟

source: Cache cleared
fa: حافظه موقت پاک شد

source: Clear
fa: پاک کردن

source: Data exported
fa: داده‌ها صادر شد

# appDescription
source: An app for reading Persian poetry with poems from Ganjoor
fa: برنامه‌ای برای مطالعه شعر فارسی با اشعار از گنجور

source: Features:
fa: امکانات:

# randomPoemFeature
source: • Get random poems
fa: • دریافت شعر تصادفی

# favoritesFeature
source: • Favorites
fa: • علاقه‌مندی‌ها

# notificationsFeature
source: • Daily notifications
fa: • اعلان‌های روزانه

# searchFeature
source: • Search and filter
fa: • جستجو و فیلتر

# helpTitle
source: Help
fa: راهنما

# howToUse
source: How to use {appName}:
fa: نحوه استفاده از {appName}:

# helpStep1
source: 1. Click the big button to get a random poem
fa: 1. برای دریافت شعر تصادفی، روی دکمه بزرگ کلیک کنید

# helpStep2
source: 2. Click the heart to add the poem to favorites
fa: 2. با کلیک روی قلب، شعر را به علاقه‌مندی‌ها اضافه کنید

# helpStep3
source: 3. In the favorites page, you can search for poems
fa: 3. در صفحه علاقه‌مندی‌ها می‌توانید اشعار را جستجو کنید

# helpStep4
source: 4. Enable daily notifications from settings
fa: 4. از تنظیمات، اعلان‌های روزانه را فعال کنید

# helpStep5
source: 5. Share poems with your friends
fa: 5. شعرها را با دوستان خود به اشتراک بگذارید

# dataSourceTitle
source: Data Source
fa: منبع داده‌ها

# ganjoorDescription
source: This app uses the Ganjoor API.
fa: این برنامه از API گنجور استفاده می‌کند.

# ganjoorInfo
source: Ganjoor is the largest Persian poetry library founded by Reza Amirhesni.
fa: گنجور بزرگترین کتابخانه شعر فارسی است که توسط رضا امیرحسنی تأسیس شده است.

# ganjoorWebsite
source: Website: ganjoor.net
fa: وب‌سایت: ganjoor.net

source: Recent Favorites
fa: علاقه‌مندی‌های اخیر

# dailyPoemNotificationTitle
source: Chakame - Daily Poem
fa: شکامه - شعر روز

# dailyPoemNotificationBody
source: A beautiful poem is ready for you
fa: شعری زیبا برای شما آماده شده است

# testNotificationTitle
source: Test Notification
fa: تست اعلان

# testNotificationBody
source: This is a test message
fa: این یک پیام آزمایشی است

source: Enabled
fa: فعال

source: Disabled
fa: غیرفعال

source: View All
fa: مشاهده همه

# searchHint
source: Search...
fa: جستجو کنید...

source: Privacy Policy
fa: حریم خصوصی

# privacyPolicySubtitle
source: How we handle your data
fa: نحوه مدیریت اطلاعات شما

# privacyPolicyTitle
source: Privacy Policy
fa: سیاست حریم خصوصی

# privacyPolicyIntro
source: This privacy policy explains how Chakame handles your personal information and data when you use our application.
fa: این سیاست حریم خصوصی نحوه مدیریت اطلاعات شخصی و داده‌های شما توسط چکامه را هنگام استفاده از برنامه توضیح می‌دهد.

# dataCollectionTitle
source: Data Collection
fa: جمع‌آوری داده‌ها

# dataCollectionContent
source: Chakame collects minimal data to provide its services: • Your favorite poems (stored locally on your device) • App settings and preferences (stored locally) • Notification preferences We do not collect personal information such as your name, email, or location.
fa: چکامه حداقل داده‌ها را برای ارائه خدمات خود جمع‌آوری می‌کند: • اشعار مورد علاقه شما (به صورت محلی در دستگاه ذخیره می‌شود) • تنظیمات و ترجیحات برنامه (به صورت محلی ذخیره می‌شود) • ترجیحات اعلان‌ها ما اطلاعات شخصی مانند نام، ایمیل یا موقعیت مکانی شما را جمع‌آوری نمی‌کنیم.

# dataUsageTitle
source: How We Use Your Data
fa: نحوه استفاده از داده‌های شما

# dataUsageContent
source: Your data is used exclusively to: • Provide personalized poetry recommendations • Save your favorite poems for easy access • Remember your app preferences • Send daily poem notifications if enabled All data remains on your device and is never transmitted to external servers.
fa: داده‌های شما منحصراً برای موارد زیر استفاده می‌شود: • ارائه پیشنهادات شعری شخصی‌سازی شده • ذخیره اشعار مورد علاقه برای دسترسی آسان • به خاطرسپاری ترجیحات برنامه • ارسال اعلان‌های روزانه شعر در صورت فعال بودن تمام داده‌ها در دستگاه شما باقی می‌ماند و هرگز به سرورهای خارجی ارسال نمی‌شود.

# dataSharingTitle
source: Data Sharing
fa: اشتراک‌گذاری داده‌ها

# dataSharingContent
source: We do not share, sell, or transmit your personal data to third parties. The app connects to the Ganjoor API only to fetch poems, but no personal information is sent with these requests.
fa: ما داده‌های شخصی شما را با اشخاص ثالث به اشتراک نمی‌گذاریم، نمی‌فروشیم یا منتقل نمی‌کنیم. برنامه تنها برای دریافت اشعار به API گنجور متصل می‌شود، اما هیچ اطلاعات شخصی با این درخواست‌ها ارسال نمی‌شود.

# dataStorageTitle
source: Data Storage
fa: ذخیره‌سازی داده‌ها

# dataStorageContent
source: All your data is stored locally on your device: • Favorites are saved in local storage • Settings are stored in app preferences • No cloud storage or external databases are used You can delete all data by clearing the app's cache or uninstalling the application.
fa: تمام داده‌های شما به صورت محلی در دستگاه ذخیره می‌شود: • علاقه‌مندی‌ها در حافظه محلی ذخیره می‌شوند • تنظیمات در ترجیحات برنامه ذخیره می‌شوند • از ذخیره‌سازی ابری یا پایگاه‌های داده خارجی استفاده نمی‌شود می‌توانید با پاک کردن حافظه موقت برنامه یا حذف برنامه، تمام داده‌ها را پاک کنید.

# userRightsTitle
source: Your Rights
fa: حقوق شما

# userRightsContent
source: You have full control over your data: • View all stored data in the app settings • Delete specific favorites or clear all data • Export your favorites for backup • Disable notifications at any time Since all data is stored locally, you have complete ownership and control.
fa: شما کنترل کاملی بر داده‌های خود دارید: • مشاهده تمام داده‌های ذخیره شده در تنظیمات برنامه • حذف علاقه‌مندی‌های خاص یا پاک کردن تمام داده‌ها • صادر کردن علاقه‌مندی‌ها برای پشتیبان‌گیری • غیرفعال کردن اعلان‌ها در هر زمان ازآنجایی که تمام داده‌ها به صورت محلی ذخیره می‌شوند، شما مالکیت و کنترل کاملی دارید.

# contactTitle
source: Contact Us
fa: تماس با ما

# contactContent
source: If you have questions about this privacy policy or how your data is handled, please contact us through the app's support channels or visit our website.
fa: اگر سؤالی درباره این سیاست حریم خصوصی یا نحوه مدیریت داده‌های شما دارید، لطفاً از طریق کانال‌های پشتیبانی برنامه با ما تماس بگیرید یا از وب‌سایت ما دیدن کنید.

# lastUpdated
source: Last updated: January 2025
fa: آخرین به‌روزرسانی: ژانویه ۲۰۲۵
